# Valid Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementBoundarySubface..::..Valid Property
SpatialElementBoundarySubface Class See Also
---
Indicates if the subface instance is valid and can be used.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool Valid { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Valid As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Valid {
	bool get ();
}
```

# See Also
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace